3D_DamBreak/system/createPatchDict.0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name back1;

        // Type of new patch
        patchInfo
        {
            type wall;
        }

        constructFrom patches;

        patches (top);
    }

    {
        name front1;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (bottom);
    }

    {
        name top1;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (front);
    }

    {
        name bottom1;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (back);
    }
);

// ************************************************************************* //
