3D_DamBreak/system/createPatchDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name back;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (back1);
    }

    {
        name bottom;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (bottom1);
    }

    {
        name top;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (top1);
    }

    {
        name front;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (front1);
    }
);

// ************************************************************************* //
